RT-Thread-packages/gd32-arm-cmsis/GD32H77x_78x/GD/GD32H77x_78x/Source/IAR/startup_gd32h77x_78x.s
        PUBWEAK USBHS1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
USBHS1_IRQHandler
        B USBHS1_IRQHandler

        PUBWEAK ENET1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ENET1_IRQHandler
        B ENET1_IRQHandler

        PUBWEAK ENET1_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ENET1_WKUP_IRQHandler
        B ENET1_WKUP_IRQHandler

        PUBWEAK CAN0_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN0_WKUP_IRQHandler
        B CAN0_WKUP_IRQHandler

        PUBWEAK CAN0_Message_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN0_Message_IRQHandler
        B CAN0_Message_IRQHandler

        PUBWEAK CAN0_Busoff_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN0_Busoff_IRQHandler
        B CAN0_Busoff_IRQHandler

        PUBWEAK CAN0_Error_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN0_Error_IRQHandler
        B CAN0_Error_IRQHandler

        PUBWEAK CAN0_FastError_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN0_FastError_IRQHandler
        B CAN0_FastError_IRQHandler

        PUBWEAK CAN0_TEC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN0_TEC_IRQHandler
        B CAN0_TEC_IRQHandler

        PUBWEAK CAN0_REC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN0_REC_IRQHandler
        B CAN0_REC_IRQHandler

        PUBWEAK CAN1_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN1_WKUP_IRQHandler
        B CAN1_WKUP_IRQHandler

        PUBWEAK CAN1_Message_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN1_Message_IRQHandler
        B CAN1_Message_IRQHandler

        PUBWEAK CAN1_Busoff_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN1_Busoff_IRQHandler
        B CAN1_Busoff_IRQHandler

        PUBWEAK CAN1_Error_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN1_Error_IRQHandler
        B CAN1_Error_IRQHandler

        PUBWEAK CAN1_FastError_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN1_FastError_IRQHandler
        B CAN1_FastError_IRQHandler

        PUBWEAK CAN1_TEC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN1_TEC_IRQHandler
        B CAN1_TEC_IRQHandler

        PUBWEAK CAN1_REC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN1_REC_IRQHandler
        B CAN1_REC_IRQHandler

        PUBWEAK CAN2_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN2_WKUP_IRQHandler
        B CAN2_WKUP_IRQHandler

        PUBWEAK CAN2_Message_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN2_Message_IRQHandler
        B CAN2_Message_IRQHandler

        PUBWEAK CAN2_Busoff_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN2_Busoff_IRQHandler
        B CAN2_Busoff_IRQHandler

        PUBWEAK CAN2_Error_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN2_Error_IRQHandler
        B CAN2_Error_IRQHandler

        PUBWEAK CAN2_FastError_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN2_FastError_IRQHandler
        B CAN2_FastError_IRQHandler

        PUBWEAK CAN2_TEC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN2_TEC_IRQHandler
        B CAN2_TEC_IRQHandler

        PUBWEAK CAN2_REC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CAN2_REC_IRQHandler
        B CAN2_REC_IRQHandler

        PUBWEAK OTP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
OTP_IRQHandler
        B OTP_IRQHandler

        PUBWEAK I2C0_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C0_WKUP_IRQHandler
        B I2C0_WKUP_IRQHandler

        PUBWEAK I2C1_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C1_WKUP_IRQHandler
        B I2C1_WKUP_IRQHandler

        PUBWEAK I2C2_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C2_WKUP_IRQHandler
        B I2C2_WKUP_IRQHandler

        PUBWEAK I2C3_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
I2C3_WKUP_IRQHandler
        B I2C3_WKUP_IRQHandler

        PUBWEAK LPDTS_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LPDTS_IRQHandler
        B LPDTS_IRQHandler

        PUBWEAK LPDTS_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
LPDTS_WKUP_IRQHandler
        B LPDTS_WKUP_IRQHandler

        PUBWEAK TIMER0_DEC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER0_DEC_IRQHandler
        B TIMER0_DEC_IRQHandler

        PUBWEAK TIMER7_DEC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER7_DEC_IRQHandler
        B TIMER7_DEC_IRQHandler

        PUBWEAK TIMER1_DEC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER1_DEC_IRQHandler
        B TIMER1_DEC_IRQHandler

        PUBWEAK TIMER2_DEC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER2_DEC_IRQHandler
        B TIMER2_DEC_IRQHandler

        PUBWEAK TIMER3_DEC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER3_DEC_IRQHandler
        B TIMER3_DEC_IRQHandler

        PUBWEAK TIMER4_DEC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER4_DEC_IRQHandler
        B TIMER4_DEC_IRQHandler

        PUBWEAK TIMER22_DEC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER22_DEC_IRQHandler
        B TIMER22_DEC_IRQHandler

        PUBWEAK TIMER23_DEC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER23_DEC_IRQHandler
        B TIMER23_DEC_IRQHandler

        PUBWEAK TIMER30_DEC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER30_DEC_IRQHandler
        B TIMER30_DEC_IRQHandler

        PUBWEAK TIMER31_DEC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER31_DEC_IRQHandler
        B TIMER31_DEC_IRQHandler

        PUBWEAK CPU_DCACHE_ERR_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CPU_DCACHE_ERR_IRQHandler
        B CPU_DCACHE_ERR_IRQHandler

        PUBWEAK CPU_ICACHE_ERR_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
CPU_ICACHE_ERR_IRQHandler
        B CPU_ICACHE_ERR_IRQHandler

        PUBWEAK VOVD_VUVD_FILTER_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
VOVD_VUVD_FILTER_IRQHandler
        B VOVD_VUVD_FILTER_IRQHandler

        PUBWEAK TIMER0_Channel_BRK_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER0_Channel_BRK_IRQHandler
        B TIMER0_Channel_BRK_IRQHandler

        PUBWEAK TIMER7_Channel_BRK_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
TIMER7_Channel_BRK_IRQHandler
        B TIMER7_Channel_BRK_IRQHandler

        PUBWEAK DSI_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
DSI_IRQHandler
        B DSI_IRQHandler

        PUBWEAK PKCAU_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
PKCAU_IRQHandler
        B PKCAU_IRQHandler

        PUBWEAK ESC_BRIDGE_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
ESC_BRIDGE_IRQHandler
        B ESC_BRIDGE_IRQHandler

        PUBWEAK EDIM_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1)
EDIM_IRQHandler
        B EDIM_IRQHandler

        END
